/* Ερώτηση για το αν το αντικείμενο βρίσκεται στο κουτί x. 
Οι πιθανές απαντήσεις στην ερώτηση αυτή είναι:
0 για όχι
1 για ναι
Σε περίπτωση καταφατικής απάντησης το παιχνίδι τελειώνει και το πρόγραμμα πρέπει να τερματίζει.*/
bool ishidden(int x);

/* Ερώτηση για το αν το κουτί x βρίσκεται πιο κοντά στο στόχο από το κουτί y.
Η ερώτηση αυτή έχει 3 διαφορετικές πιθανές απαντήσεις:
1 σε περίπτωση που το κουτί x βρίσκεται πιο κοντά στο στόχο από το κουτί y
0 σε περίπτωση που τα κουτιά x και y ισαπέχουν από το στόχο
-1 σε περίπτωση που το κουτί y βρίσκεται πιο κοντά στο στόχο από το κουτί x */
int compare(int x, int y);

/* όταν το πρόγραμμα ξεκινήσει πρέπει πρώτα να ζητήσει το πλήθος Ν των κουτιών 
πριν κάνει οποιαδήποτε ερώτηση μέσω της συνάρτησης getN() */
int getN(void);